Revit 2027 API
IExternalResourceServer.GetIconPath Method
 Implement this method to return the path to an icon file which will be displayed in Revit user interfaces associated to this server.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
string GetIconPath()
Function GetIconPath As String
String^ GetIconPath()
abstract GetIconPath : unit -> string
Return Value
String
 The image file of the server.
Remarks
The specified image will be displayed in the browser dialogs when the user is selecting a resource of a compatible type.
The return must be the full path to an icon file containing 48x48, 32x32 and 16x16 pixel images.
If this method returns anything other than a valid icon file, a default image will be used for the server.
See Also
Reference
IExternalResourceServer Interface
Autodesk.Revit.DB Namespace